
Процедура ПриНачалеРаботыСистемы()
	
	//ПредупреждениеАсинх("Приложение на платформе 1С:Предприятие 8 готово к работе", 5, "Приветствие");
	
	ДатаСегодня = ТекущаяДата();
	
	ЧасыНачалаРабочегоДня   = 9;
	МинутыНачалаРабочегоДня = 0;
	ДатаНачалаРабочегоДня   = НачалоДня(ДатаСегодня) + (ЧасыНачалаРабочегоДня * 60 + МинутыНачалаРабочегоДня) * 60;
	
	Если ДатаСегодня >= ДатаНачалаРабочегоДня Тогда
	
		ШаблонПриветствия             = "Сегодня %1 (минут с начала рабочего дня: %2)";
		ДатаСегодняПредставление      = Формат(ДатаСегодня, "ДФ=dd.MM");
		ПрошлоМинутСНачалаРабочегоДня = Цел((ДатаСегодня - ДатаНачалаРабочегоДня) / 60);
		
		Приветствие = СтрШаблон(ШаблонПриветствия, ДатаСегодняПредставление, ПрошлоМинутСНачалаРабочегоДня);
		
		Сообщить(Приветствие);
		
	КонецЕсли;
	
	// Ближайшие праздники
	МассивПраздников = Новый Массив;
	
	// 16.10
	ОписаниеПраздника = Новый Структура("День, Месяц, Название");
	ОписаниеПраздника.День     = 16;
	Описаниепраздника.Месяц    = 10;
	ОписаниеПраздника.Название = "Всемирный день хлеба";
	
	МассивПраздников.Добавить(ОписаниеПраздника);

	ОписаниеПраздника = Новый Структура("День, Месяц, Название");
	ОписаниеПраздника.День     = 16;
	Описаниепраздника.Месяц    = 10;
	ОписаниеПраздника.Название = "Всемирный день позвоночника";
	
	МассивПраздников.Добавить(ОписаниеПраздника);

	// 17.10
    ОписаниеПраздника = Новый Структура("День, Месяц, Название");
	ОписаниеПраздника.День     = 17;
	Описаниепраздника.Месяц    = 10;
	ОписаниеПраздника.Название = "День нежности";
	
	МассивПраздников.Добавить(ОписаниеПраздника);

    ОписаниеПраздника = Новый Структура("День, Месяц, Название");
	ОписаниеПраздника.День     = 17;
	Описаниепраздника.Месяц    = 10;
	ОписаниеПраздника.Название = "День лешего";
	
	МассивПраздников.Добавить(ОписаниеПраздника);
	
	// 18.10
    ОписаниеПраздника = Новый Структура("День, Месяц, Название");
	ОписаниеПраздника.День     = 18;
	Описаниепраздника.Месяц    = 10;
	ОписаниеПраздника.Название = "Всемирный день конфет";
	
	МассивПраздников.Добавить(ОписаниеПраздника);

    ОписаниеПраздника = Новый Структура("День, Месяц, Название");
	ОписаниеПраздника.День     = 18;
	Описаниепраздника.Месяц    = 10;
	ОписаниеПраздника.Название = "Всемирнй день гитары";
	
	МассивПраздников.Добавить(ОписаниеПраздника);

	ОписаниеПраздника = Новый Структура("День, Месяц, Название");
	ОписаниеПраздника.День     = 18;
	Описаниепраздника.Месяц    = 10;
	ОписаниеПраздника.Название = "День кудесника";
	
	МассивПраздников.Добавить(ОписаниеПраздника);
	
	ДеньМесяцаСегодня  = День(ДатаСегодня);
	НомерМесяцаСегодня = Месяц(ДатаСегодня);
	
	ДатаЗавтра = ДатаСегодня + 86400;
	ДеньМесяцаЗавтра  = День(ДатаЗавтра);
	НомерМесяцаЗавтра = Месяц(ДатаЗавтра);
	
	Для Каждого Праздник Из МассивПраздников Цикл
		
		Если Праздник.Месяц = НомерМесяцаСегодня И Праздник.День = ДеньМесяцаСегодня Тогда
			
			Сообщить(СтрШаблон("Поздравляем сегодня с праздником ""%1"".", Праздник.Название));
			
		КонецЕсли;
			
		Если Праздник.Месяц = НомерМесяцаЗавтра И Праздник.День = ДеньМесяцаЗавтра Тогда
			
			Сообщить(СтрШаблон("Поздравляем с наступающим завтра праздником ""%1"".", Праздник.Название));
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Поздравление сотрудника с Днем рождения
	
	ПоздравитьСотрудникаСДнемРождения();

КонецПроцедуры

Процедура ПоздравитьСотрудникаСДнемРождения()

	ДатаРожденияСотрудника = СотрудникиВызовСервера.ДеньРожденияТекущегоПользователя();
	
	Если НЕ ЗначениеЗаполнено(ДатаРожденияСотрудника) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДатаТекущая = ТекущаяДата();
	
	ДатаТекущаяМесяц = Месяц(ДатаТекущая);
	ДатаТекущаяДень  = День(ДатаТекущая);

	ДатаРожденияМесяц = Месяц(ДатаРожденияСотрудника);
	ДатаРожденияДень  = День(ДатаРожденияСотрудника);

	Если ДатаТекущаяМесяц = ДатаРожденияМесяц И ДатаТекущаяДень = ДатаРожденияДень Тогда
		
		Сообщить("У Вас сегодня День рождения - поздравляем!");
		
	КонецЕсли;

КонецПроцедуры