
// Функция возвращает значение параметра сеанса "Сотрудник текущего пользователя"
// 
// Возвращаемое значение:
//  Сотрудник - ссылка на элемент справочника "Сотрудники",
//					имя которого полностью соответствуюет полному имени пользователя
//
Функция СотрудникТекущегоПользователя() Экспорт
	
	Возврат ПараметрыСеанса.СотрудникТекущегоПользователя;
	
КонецФункции                                              

// Функция возращает дату рождения текущего пользователя
// 
// Возвращаемое значение:
//  Дата		- дата рождения текущего пользователя
//  Пустая дата - если текущий пользователь не найден в справочнике "Сотрудники"
//					или в справочнике "Сотрудники" не указана дата рождения сотрудника
//
Функция ДеньРожденияТекущегоПользователя() Экспорт
	
	СотрудникТекущегоПользователя = СотрудникТекущегоПользователя();
	
	Если ЗначениеЗаполнено(СотрудникТекущегоПользователя) Тогда
		
		Возврат СотрудникТекущегоПользователя.ДатаРождения;
		
	Иначе
		
		Возврат Дата(1, 1, 1);
		
	КонецЕсли;
	
КонецФункции