
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Тип           = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	Ответственный = СотрудникиСервер.СотрудникТекущегоПользователя();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЭтоЮридическоеЛицо       = (Тип = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
	ВведенныеДанныеКорректны = Истина;
	УказанныйИННКорректен    = Истина;
	УказанныйКППКорректен    = Истина;
	
	Если ЭтоЮридическоеЛицо Тогда
		
		Если НЕ (ЗначениеЗаполнено(ИНН) И ЗначениеЗаполнено(КПП)) Тогда
			
			Сообщить("Для юридического лица ИНН и КПП должны быть заполнены.");
			
			ВведенныеДанныеКорректны = Ложь;
			
		КонецЕсли;
		
		Если СтрДлина(ИНН) <> 10 Тогда
			
			Сообщить("Длина ИНН должна быть 10 символов.");
			
			УказанныйИННКорректен = Ложь;
			
		КонецЕсли;

		Если СтрДлина(КПП) <> 9 Тогда
			
			Сообщить("Длина КПП должна быть 9 символов.");
			
			УказанныйКППКорректен = Ложь;
			
		КонецЕсли;

	Иначе
		
		Если НЕ ЗначениеЗаполнено(ИНН) ИЛИ ЗначениеЗаполнено(КПП) Тогда
			
			Сообщить("Для физического лица ИНН должно быть заполнено, КПП не указывается.");
			
			ВведенныеДанныеКорректны = Ложь;
			
		КонецЕсли;
		
		Если СтрДлина(ИНН) <> 12 Тогда
			
			Сообщить("Длина ИНН должна быть 12 символов.");
			
			УказанныйИННКорректен = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;

	Если УказанныйИННКорректен Тогда
		
		Если ТолькоЦифрыВСтроке(ИНН) Тогда
			
			Если НЕ РаботаСИНН.ИННВерен(ИНН) Тогда
				
				Сообщить("ИНН не прошел проверку на контрольный символ. Проверьте введенные данные.");
			
				УказанныйИННКорректен = Ложь;
				
			КонецЕсли;

		Иначе
			
			Сообщить("ИНН может состоять только из цифр.");
			
			УказанныйИННКорректен = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если УказанныйКППКорректен И НЕ ТолькоЦифрыВСтроке(КПП) Тогда

		Сообщить("ИНН может состоять только из цифр.");
		
		УказанныйКППКорректен = Ложь;
			
	КонецЕсли;
	
	Отказ = НЕ (ВведенныеДанныеКорректны И УказанныйИННКорректен И УказанныйКППКорректен);
	
КонецПроцедуры

Функция ТолькоЦифрыВСтроке(СтрокаДляПроверки)
	
	СтрокаЦифр = "0123456789";
	
	Для Счетчик = 1 По СтрДлина(СтрокаДляПроверки) Цикл
		
		ТекущийСимвол = Сред(СтрокаДляПроверки, Счетчик, 1);
		
		Если СтрНайти(СтрокаЦифр, ТекущийСимвол) = 0 Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;

КонецФункции
